/*
1.31.1. Среднее геометрическое и многомерный мир.

Не задумывался над потаёной сущностью среднего геометрического.
Но решая простейшую задачу вспомнил формулу, подумал о геометрической сути
вдруг уловил одну ускользавшую до этого деталь: дальше евклидова представления
о среднем геометрическом начинается слом мозга:
       Среднее геометрическое двух переменных легко визуализируется как сторона
квадрата, площадь которого равна площади прямоугольника со сторонами равными
длинам приводимых к среднему геометрическому.
       Среднее геометрическое трех переменных - сторона куба по объему равного
объему параллелепипеда, образованного тремя пересекающимися под углами в 90  градусов.

	Пока просто.

       	Среднее геометрическое четырех переменных... Э-э-э-э-э...
А это что ещё за х...ня?!
	У квадрата углы 90⁰, у куба - тоже, а вот под каким углом пересекаются
грани у четырехмерной? Что на что делить? Мозг бастует, а логика подсказывает:
"Сука, ведь точно - 90⁰!" Ученик первых двух уроков первого класса берет счетные
палочки, чуть пластилина ( или чего ещё ), лепит эти "прямые углы" и проверяет
сделанное девственным треуголником из набора "Подарок первокласснику".
И уже 17 палочку не знает как прилепить. Начинает некрасиво плакать и выходить
в туалет не отпрашиваясь, на месте.
       Плакать не будем, а примем на веру три факта:
первый - как бы не выглядел угол - он остается "прямым" и равен 90⁰,
второй - как бы не выглядела длина ребра - она та, что задана в условиях
( примитивное представление - если встать на ребро и измерять шагами получится
то же сумма, которая будет у такого же ребра, пусть даже выглядящего
длиннее или короче ),
третий ( вывод из первого ) - каждый отрезок параллелен координатным осям
в изучаемом мире.

       Без конкретных цифр сложно это представить. И предстоит расчитать:

       а) Каков объем n-мерного куба?
       б) Сколько граней у многомерного куба?
       в) Каков периметр?
       г) Какие размеры будут у трехмерного куба, обладающего
       аналогичным объёмом и периметром?
 */
package main

func main() {
}
