/*
1.31.1. Среднее геометрическое и многомерный мир.

	Никогда не задумывался над какой-то потаёной сущностью среднего геометрического.
Но решая простейшую задачу вспомнил формулу, подумал о её геометрической сути и
вдруг уловил одну ускользавшую до этого деталь: дальше евклидова поедатавления
о среднем геометрическом начинается слом мозга:
	Среднее геометрическое двух переменных легко визуализируется как одна из сторон
квадрата, площадь которого равна площади прямоугольника со сторонами равными длинам
приводимых к среднему геометрическому.
	Среднее геометрическое трех переменных - сторона куба по объему равного объему
параллелепипеда, образованного тремя пересекающимися под углами в 90  градусов. Пока всё просто.
	Среднее геометрическое четырех переменных... Э-э-э-э-э... А это что ещё за х...ня?!
У квадрата все углы 90⁰, у куба - та-же хрень, а вот у этой фигни сколько? На что
надо что делить? Мозг бастует, а логика подсказывает: "Сука, всё равно - 90!" Ученик первых
двух уроков первого класса берет счетные палочки, немного пластилина ( или чего ещё ),
начинает лепить эти самые "прямые углы" и проверять их девственным треуголником из набора
"Подарок первокласснику". И уже 17 палочку не может прилепить никуда. Начинает некрасиво
плакать и выходить в туалет прямо на месте.
	Мы плакать не будем, а примем на веру три факта:
первый - как бы не выглядел угол - он все
равно остается "прямым" и равен 90⁰,
второй - как бы не выглядела длина ребра - она именно та,
которая задана в условиях ( примитивное представление - если мы встанем на ребро и будем измерять
его шагами - у нас обязательно получится та же сумма, которая будет у такого же ребра,
пусть даже выглядящего длинее или короче ),
третий ( вывод из первого ) каждый отрезок строго параллелен системе координат
в изучаемом мире.

	Без конкретных цифр довольно сложно это представить. И нам предстоит расчитать:
	а) Каков объем n-мерного куба?
	б) Сколько граней у многомерного куба?
	в) Каков его периметр?
	г) Какие размеры будут у обычного, трехмерного куба, обладающего аналогичным объёмом
	и периметром?

 */

package main

func main() {
}
