/*
Выделение цифр в записи числа.
2.20. Дано четырехзначное число. Найти:
а) число, полученное при прочтении его цифр справа налево;
б) число, образуемое пр перестановке первой и второй, третьей и четвёртой цифр заданного числа. Например, из числа 5434 получить 4543, из числа 7048 - 784;
в) число, образуемое при перестановке второй и третьей цифр заданного числа. Например, из числа 5084 получить 5804.
г) число, полученное при перестановке двух первых и двух последних цифр заданного числа. Например, из числа 4566 получить 6645, из числа 7304 - 473.

Последнюю задачу можно решить двумя способами:

1) с выделением отдельных цифр заданного числа;
2) без выделения отдельных цифр заданного числа.
 
*/
